garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/edc/PIC18F55Q71.PIC
          <edc:SFRDef edc:access="------nn" edc:cname="DAC1DATH" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------00" edc:name="DAC1DATH" edc:nzwidth="8" edc:por="------00" edc:_modsrc="DOS-04058_dac_nbit_ctrl_v6.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x3" edc:_addr="0x7E">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="DAC1R" edc:mask="0x3" edc:name="DAC1R" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="DAC1R8" edc:mask="0x1" edc:name="DAC1R8" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DAC1R9" edc:mask="0x1" edc:name="DAC1R9" edc:nzwidth="0x1"/>
                <edc:AdjustPoint edc:offset="1"/>
                <edc:AdjustPoint edc:offset="1"/>
                <edc:AdjustPoint edc:offset="1"/>
                <edc:AdjustPoint edc:offset="1"/>
                <edc:AdjustPoint edc:offset="1"/>
                <edc:AdjustPoint edc:offset="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="DAC1RH" edc:mask="0x3" edc:name="DAC1RH" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="n-nnnn-n" edc:cname="DAC1CON" edc:desc="" edc:impl="0x3c" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-0000-0" edc:name="DAC1CON" edc:nzwidth="8" edc:por="0-0000-0" edc:_modsrc="DOS-04058_dac_nbit_ctrl_v6.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x3" edc:_addr="0x7F">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="NSS" edc:desc="" edc:mask="0x1" edc:name="NSS" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="PSS" edc:desc="" edc:mask="0x3" edc:name="PSS" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="OE" edc:desc="" edc:mask="0x3" edc:name="OE" edc:nzwidth="3"/>
              <edc:SFRFieldDef edc:cname="EN" edc:desc="" edc:mask="0x1" edc:name="EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="DAC1NSS" edc:mask="0x1" edc:name="DAC1NSS" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="DAC1PSS0" edc:mask="0x1" edc:name="DAC1PSS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DAC1PSS1" edc:mask="0x1" edc:name="DAC1PSS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DAC1OE" edc:mask="0x3" edc:name="DAC1OE" edc:nzwidth="3"/>
              <edc:SFRFieldDef edc:cname="DAC1EN" edc:mask="0x1" edc:name="DAC1EN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="NSS0" edc:mask="0x1" edc:name="NSS0" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="PSS0" edc:mask="0x1" edc:name="PSS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PSS1" edc:mask="0x1" edc:name="PSS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OE0" edc:mask="0x1" edc:name="OE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OE1" edc:mask="0x1" edc:name="OE1" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rrrrrrrr" edc:cname="SPI1RXB" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="SPI1RXB" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02941_spi_8bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xd" edc:_addr="0x80">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RXB" edc:mask="0xff" edc:name="RXB" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RXB0" edc:mask="0x1" edc:name="RXB0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1" edc:mask="0x1" edc:name="RXB1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB2" edc:mask="0x1" edc:name="RXB2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB3" edc:mask="0x1" edc:name="RXB3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB4" edc:mask="0x1" edc:name="RXB4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB5" edc:mask="0x1" edc:name="RXB5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB6" edc:mask="0x1" edc:name="RXB6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB7" edc:mask="0x1" edc:name="RXB7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="wwwwwwww" edc:cname="SPI1TXB" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="SPI1TXB" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02941_spi_8bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xd" edc:_addr="0x81">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TXB" edc:mask="0xff" edc:name="TXB" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="TXB0" edc:mask="0x1" edc:name="TXB0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB1" edc:mask="0x1" edc:name="TXB1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB2" edc:mask="0x1" edc:name="TXB2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB3" edc:mask="0x1" edc:name="TXB3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB4" edc:mask="0x1" edc:name="TXB4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB5" edc:mask="0x1" edc:name="TXB5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB6" edc:mask="0x1" edc:name="TXB6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB7" edc:mask="0x1" edc:name="TXB7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:JoinedSFRDef edc:cname="SPI1TCNT" edc:desc="" edc:name="SPI1TCNT" edc:nzwidth="0x10" edc:_modsrc="DOS-02941_spi_8bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xd" edc:_addr="0x82">
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="SPI1TCNTL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="SPI1TCNTL" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02941_spi_8bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xd" edc:_addr="0x82">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="TCNTL" edc:mask="0xff" edc:name="TCNTL" edc:nzwidth="0x8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="-----nnn" edc:cname="SPI1TCNTH" edc:desc="" edc:impl="0x7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----000" edc:name="SPI1TCNTH" edc:nzwidth="8" edc:por="-----000" edc:_modsrc="DOS-02941_spi_8bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xd" edc:_addr="0x83">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="TCNTH" edc:mask="0x7" edc:name="TCNTH" edc:nzwidth="0x3"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="n----nnn" edc:cname="SPI1CON0" edc:desc="" edc:impl="0x87" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0----000" edc:name="SPI1CON0" edc:nzwidth="8" edc:por="0----000" edc:_modsrc="DOS-02941_spi_8bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xd" edc:_addr="0x84">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="BMODE" edc:mask="0x1" edc:name="BMODE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MST" edc:mask="0x1" edc:name="MST" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LSBF" edc:mask="0x1" edc:name="LSBF" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x4"/>
              <edc:SFRFieldDef edc:cname="EN" edc:mask="0x1" edc:name="EN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="SPI1BMODE" edc:mask="0x1" edc:name="SPI1BMODE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI1MST" edc:mask="0x1" edc:name="SPI1MST" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI1LSBF" edc:mask="0x1" edc:name="SPI1LSBF" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x4"/>
              <edc:SFRFieldDef edc:cname="SPI1SPIEN" edc:mask="0x1" edc:name="SPI1SPIEN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
