garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/edc/PIC18F55Q71.PIC
        <edc:SFRDef edc:access="rrrrrrrr" edc:cname="DMAnBUF" edc:desc="DMA data buffer" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="DMAnBUF" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-03034_dma_8bit_v1_overlaid.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x18" edc:_addr="0xE9">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="BUF" edc:mask="0xff" edc:name="BUF" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="BUF0" edc:mask="0x1" edc:name="BUF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BUF1" edc:mask="0x1" edc:name="BUF1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BUF2" edc:mask="0x1" edc:name="BUF2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BUF3" edc:mask="0x1" edc:name="BUF3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BUF4" edc:mask="0x1" edc:name="BUF4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BUF5" edc:mask="0x1" edc:name="BUF5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BUF6" edc:mask="0x1" edc:name="BUF6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BUF7" edc:mask="0x1" edc:name="BUF7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:JoinedSFRDef edc:cname="DMAnDCNT" edc:desc="DMA destination count register" edc:name="DMAnDCNT" edc:nzwidth="0x10" edc:_modsrc="DOS-03034_dma_8bit_v1_overlaid.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x18" edc:_addr="0xEA">
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="DMAnDCNTL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="DMAnDCNTL" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03034_dma_8bit_v1_overlaid.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x18" edc:_addr="0xEA">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="DCNT" edc:mask="0xff" edc:name="DCNT" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="DCNT0" edc:mask="0x1" edc:name="DCNT0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DCNT1" edc:mask="0x1" edc:name="DCNT1" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DCNT2" edc:mask="0x1" edc:name="DCNT2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DCNT3" edc:mask="0x1" edc:name="DCNT3" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DCNT4" edc:mask="0x1" edc:name="DCNT4" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DCNT5" edc:mask="0x1" edc:name="DCNT5" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DCNT6" edc:mask="0x1" edc:name="DCNT6" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DCNT7" edc:mask="0x1" edc:name="DCNT7" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="----nnnn" edc:cname="DMAnDCNTH" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="DMAnDCNTH" edc:nzwidth="8" edc:por="----0000" edc:_modsrc="DOS-03034_dma_8bit_v1_overlaid.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x18" edc:_addr="0xEB">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="DCNT" edc:mask="0xf" edc:name="DCNT" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="DCNT8" edc:mask="0x1" edc:name="DCNT8" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DCNT9" edc:mask="0x1" edc:name="DCNT9" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DCNT10" edc:mask="0x1" edc:name="DCNT10" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DCNT11" edc:mask="0x1" edc:name="DCNT11" edc:nzwidth="0x1"/>
                <edc:AdjustPoint edc:offset="1"/>
                <edc:AdjustPoint edc:offset="1"/>
                <edc:AdjustPoint edc:offset="1"/>
                <edc:AdjustPoint edc:offset="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:JoinedSFRDef edc:cname="DMAnDPTR" edc:desc="DMA destination pointer register" edc:name="DMAnDPTR" edc:nzwidth="0x10" edc:_modsrc="DOS-03034_dma_8bit_v1_overlaid.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x18" edc:_addr="0xEC">
          <edc:SFRDef edc:access="rrrrrrrr" edc:cname="DMAnDPTRL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="DMAnDPTRL" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03034_dma_8bit_v1_overlaid.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x18" edc:_addr="0xEC">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="DPTR" edc:mask="0xff" edc:name="DPTR" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="DPTR0" edc:mask="0x1" edc:name="DPTR0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DPTR1" edc:mask="0x1" edc:name="DPTR1" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DPTR2" edc:mask="0x1" edc:name="DPTR2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DPTR3" edc:mask="0x1" edc:name="DPTR3" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DPTR4" edc:mask="0x1" edc:name="DPTR4" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DPTR5" edc:mask="0x1" edc:name="DPTR5" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DPTR6" edc:mask="0x1" edc:name="DPTR6" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DPTR7" edc:mask="0x1" edc:name="DPTR7" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="rrrrrrrr" edc:cname="DMAnDPTRH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="DMAnDPTRH" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03034_dma_8bit_v1_overlaid.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x18" edc:_addr="0xED">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="DPTR" edc:mask="0xff" edc:name="DPTR" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="DPTR8" edc:mask="0x1" edc:name="DPTR8" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DPTR9" edc:mask="0x1" edc:name="DPTR9" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DPTR10" edc:mask="0x1" edc:name="DPTR10" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DPTR11" edc:mask="0x1" edc:name="DPTR11" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DPTR12" edc:mask="0x1" edc:name="DPTR12" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DPTR13" edc:mask="0x1" edc:name="DPTR13" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DPTR14" edc:mask="0x1" edc:name="DPTR14" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DPTR15" edc:mask="0x1" edc:name="DPTR15" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
