garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/edc/PIC18F55Q71.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PORTWDF" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PORTWDF" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-05249_io_vport_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xd" edc:_addr="0x10B">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DF0" edc:desc="" edc:mask="0x1" edc:name="DF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DF1" edc:desc="" edc:mask="0x1" edc:name="DF1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DF2" edc:desc="" edc:mask="0x1" edc:name="DF2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DF3" edc:desc="" edc:mask="0x1" edc:name="DF3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DF4" edc:desc="" edc:mask="0x1" edc:name="DF4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DF5" edc:desc="" edc:mask="0x1" edc:name="DF5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DF6" edc:desc="" edc:mask="0x1" edc:name="DF6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DF7" edc:desc="" edc:mask="0x1" edc:name="DF7" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PWDF0" edc:desc="" edc:mask="0x1" edc:name="PWDF0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWDF1" edc:desc="" edc:mask="0x1" edc:name="PWDF1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWDF2" edc:mask="0x1" edc:name="PWDF2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWDF3" edc:desc="" edc:mask="0x1" edc:name="PWDF3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWDF4" edc:mask="0x1" edc:name="PWDF4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWDF5" edc:mask="0x1" edc:name="PWDF5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWDF6" edc:mask="0x1" edc:name="PWDF6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWDF7" edc:mask="0x1" edc:name="PWDF7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="DF" edc:mask="0xff" edc:name="DF" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="PWDF" edc:mask="0xff" edc:name="PWDF" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-------n" edc:cname="PORTWCON" edc:desc="" edc:impl="0x1" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------0" edc:name="PORTWCON" edc:nzwidth="8" edc:por="-------0" edc:_modsrc="DOS-05249_io_vport_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xd" edc:_addr="0x10C">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CLKEN" edc:desc="" edc:mask="0x1" edc:name="CLKEN" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0x3" edc:_addr="0x10D"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="ADCGA" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="ADCGA" edc:nzwidth="8" edc:por="00000000" edc:_addr="0x110">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CGA0" edc:mask="0x1" edc:name="CGA0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CGA1" edc:mask="0x1" edc:name="CGA1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CGA2" edc:mask="0x1" edc:name="CGA2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CGA3" edc:mask="0x1" edc:name="CGA3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CGA4" edc:mask="0x1" edc:name="CGA4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CGA5" edc:mask="0x1" edc:name="CGA5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CGA6" edc:mask="0x1" edc:name="CGA6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CGA7" edc:mask="0x1" edc:name="CGA7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ADCGA0" edc:mask="0x1" edc:name="ADCGA0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADCGA1" edc:mask="0x1" edc:name="ADCGA1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADCGA2" edc:mask="0x1" edc:name="ADCGA2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADCGA3" edc:mask="0x1" edc:name="ADCGA3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADCGA4" edc:mask="0x1" edc:name="ADCGA4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADCGA5" edc:mask="0x1" edc:name="ADCGA5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADCGA6" edc:mask="0x1" edc:name="ADCGA6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADCGA7" edc:mask="0x1" edc:name="ADCGA7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="ADCGB" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="ADCGB" edc:nzwidth="8" edc:por="00000000" edc:_addr="0x111">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CGB0" edc:mask="0x1" edc:name="CGB0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CGB1" edc:mask="0x1" edc:name="CGB1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CGB2" edc:mask="0x1" edc:name="CGB2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CGB3" edc:mask="0x1" edc:name="CGB3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CGB4" edc:mask="0x1" edc:name="CGB4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CGB5" edc:mask="0x1" edc:name="CGB5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CGB6" edc:mask="0x1" edc:name="CGB6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CGB7" edc:mask="0x1" edc:name="CGB7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ADCGB0" edc:mask="0x1" edc:name="ADCGB0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADCGB1" edc:mask="0x1" edc:name="ADCGB1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADCGB2" edc:mask="0x1" edc:name="ADCGB2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADCGB3" edc:mask="0x1" edc:name="ADCGB3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADCGB4" edc:mask="0x1" edc:name="ADCGB4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADCGB5" edc:mask="0x1" edc:name="ADCGB5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADCGB6" edc:mask="0x1" edc:name="ADCGB6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADCGB7" edc:mask="0x1" edc:name="ADCGB7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="ADCGC" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="ADCGC" edc:nzwidth="8" edc:por="00000000" edc:_addr="0x112">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CGC0" edc:mask="0x1" edc:name="CGC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CGC1" edc:mask="0x1" edc:name="CGC1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CGC2" edc:mask="0x1" edc:name="CGC2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CGC3" edc:mask="0x1" edc:name="CGC3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CGC4" edc:mask="0x1" edc:name="CGC4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CGC5" edc:mask="0x1" edc:name="CGC5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CGC6" edc:mask="0x1" edc:name="CGC6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CGC7" edc:mask="0x1" edc:name="CGC7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ADCGC0" edc:mask="0x1" edc:name="ADCGC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADCGC1" edc:mask="0x1" edc:name="ADCGC1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADCGC2" edc:mask="0x1" edc:name="ADCGC2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADCGC3" edc:mask="0x1" edc:name="ADCGC3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADCGC4" edc:mask="0x1" edc:name="ADCGC4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADCGC5" edc:mask="0x1" edc:name="ADCGC5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADCGC6" edc:mask="0x1" edc:name="ADCGC6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADCGC7" edc:mask="0x1" edc:name="ADCGC7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="ADCGD" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="ADCGD" edc:nzwidth="8" edc:por="00000000" edc:_addr="0x113">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CGD0" edc:mask="0x1" edc:name="CGD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CGD1" edc:mask="0x1" edc:name="CGD1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CGD2" edc:mask="0x1" edc:name="CGD2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CGD3" edc:mask="0x1" edc:name="CGD3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CGD4" edc:mask="0x1" edc:name="CGD4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CGD5" edc:mask="0x1" edc:name="CGD5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CGD6" edc:mask="0x1" edc:name="CGD6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CGD7" edc:mask="0x1" edc:name="CGD7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ADCGD0" edc:mask="0x1" edc:name="ADCGD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADCGD1" edc:mask="0x1" edc:name="ADCGD1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADCGD2" edc:mask="0x1" edc:name="ADCGD2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADCGD3" edc:mask="0x1" edc:name="ADCGD3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADCGD4" edc:mask="0x1" edc:name="ADCGD4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADCGD5" edc:mask="0x1" edc:name="ADCGD5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADCGD6" edc:mask="0x1" edc:name="ADCGD6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADCGD7" edc:mask="0x1" edc:name="ADCGD7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
