garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/edc/PIC18F55Q71.PIC
        <edc:AdjustPoint edc:offset="0x2" edc:_modsrc="DOS-xxxx_pps_mid_v3_input_Q71_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x3d" edc:_addr="0x259"/>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="CWG1PPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="CWG1PPS" edc:nzwidth="8" edc:por="--001000" edc:_modsrc="DOS-xxxx_pps_mid_v3_input_Q71_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x3d" edc:_addr="0x25B">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="CWG1INPPS"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x7" edc:name="PORT" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CWGINPPS0" edc:mask="0x1" edc:name="CWGINPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWGINPPS1" edc:mask="0x1" edc:name="CWGINPPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWGINPPS2" edc:mask="0x1" edc:name="CWGINPPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWGINPPS3" edc:mask="0x1" edc:name="CWGINPPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWGINPPS4" edc:mask="0x1" edc:name="CWGINPPS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWGINPPS5" edc:mask="0x1" edc:name="CWGINPPS5" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="CWG1INPPS" edc:mask="0x3f" edc:name="CWG1INPPS" edc:nzwidth="0x6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="CWG1INPPS0" edc:mask="0x1" edc:name="CWG1INPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG1INPPS1" edc:mask="0x1" edc:name="CWG1INPPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG1INPPS2" edc:mask="0x1" edc:name="CWG1INPPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG1INPPS3" edc:mask="0x1" edc:name="CWG1INPPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG1INPPS4" edc:mask="0x1" edc:name="CWG1INPPS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG1INPPS5" edc:mask="0x1" edc:name="CWG1INPPS5" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.3">
              <edc:SFRFieldDef edc:cname="CWGINPPS" edc:mask="0x3f" edc:name="CWGINPPS" edc:nzwidth="0x6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0x5" edc:_modsrc="DOS-xxxx_pps_mid_v3_input_Q71_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x3d" edc:_addr="0x25C"/>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="CLCIN0PPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="CLCIN0PPS" edc:nzwidth="8" edc:por="--000000" edc:_modsrc="DOS-xxxx_pps_mid_v3_input_Q71_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x3d" edc:_addr="0x261">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x7" edc:name="PORT" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CLCIN0PPS0" edc:mask="0x1" edc:name="CLCIN0PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLCIN0PPS1" edc:mask="0x1" edc:name="CLCIN0PPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLCIN0PPS2" edc:mask="0x1" edc:name="CLCIN0PPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLCIN0PPS3" edc:mask="0x1" edc:name="CLCIN0PPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLCIN0PPS4" edc:mask="0x1" edc:name="CLCIN0PPS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLCIN0PPS5" edc:mask="0x1" edc:name="CLCIN0PPS5" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="CLCIN0PPS" edc:mask="0x3f" edc:name="CLCIN0PPS" edc:nzwidth="0x6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="CLCIN1PPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="CLCIN1PPS" edc:nzwidth="8" edc:por="--000001" edc:_modsrc="DOS-xxxx_pps_mid_v3_input_Q71_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x3d" edc:_addr="0x262">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x7" edc:name="PORT" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CLCIN1PPS0" edc:mask="0x1" edc:name="CLCIN1PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLCIN1PPS1" edc:mask="0x1" edc:name="CLCIN1PPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLCIN1PPS2" edc:mask="0x1" edc:name="CLCIN1PPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLCIN1PPS3" edc:mask="0x1" edc:name="CLCIN1PPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLCIN1PPS4" edc:mask="0x1" edc:name="CLCIN1PPS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLCIN1PPS5" edc:mask="0x1" edc:name="CLCIN1PPS5" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="CLCIN1PPS" edc:mask="0x3f" edc:name="CLCIN1PPS" edc:nzwidth="0x6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="CLCIN2PPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="CLCIN2PPS" edc:nzwidth="8" edc:por="--001110" edc:_modsrc="DOS-xxxx_pps_mid_v3_input_Q71_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x3d" edc:_addr="0x263">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x7" edc:name="PORT" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CLCIN2PPS0" edc:mask="0x1" edc:name="CLCIN2PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLCIN2PPS1" edc:mask="0x1" edc:name="CLCIN2PPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLCIN2PPS2" edc:mask="0x1" edc:name="CLCIN2PPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLCIN2PPS3" edc:mask="0x1" edc:name="CLCIN2PPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLCIN2PPS4" edc:mask="0x1" edc:name="CLCIN2PPS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLCIN2PPS5" edc:mask="0x1" edc:name="CLCIN2PPS5" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="CLCIN2PPS" edc:mask="0x3f" edc:name="CLCIN2PPS" edc:nzwidth="0x6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="CLCIN3PPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="CLCIN3PPS" edc:nzwidth="8" edc:por="--001111" edc:_modsrc="DOS-xxxx_pps_mid_v3_input_Q71_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x3d" edc:_addr="0x264">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x7" edc:name="PORT" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CLCIN3PPS0" edc:mask="0x1" edc:name="CLCIN3PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLCIN3PPS1" edc:mask="0x1" edc:name="CLCIN3PPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLCIN3PPS2" edc:mask="0x1" edc:name="CLCIN3PPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLCIN3PPS3" edc:mask="0x1" edc:name="CLCIN3PPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLCIN3PPS4" edc:mask="0x1" edc:name="CLCIN3PPS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLCIN3PPS5" edc:mask="0x1" edc:name="CLCIN3PPS5" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="CLCIN3PPS" edc:mask="0x3f" edc:name="CLCIN3PPS" edc:nzwidth="0x6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="CLCIN4PPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="CLCIN4PPS" edc:nzwidth="8" edc:por="--000000" edc:_modsrc="DOS-xxxx_pps_mid_v3_input_Q71_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x3d" edc:_addr="0x265">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x7" edc:name="PORT" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CLCIN4PPS0" edc:mask="0x1" edc:name="CLCIN4PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLCIN4PPS1" edc:mask="0x1" edc:name="CLCIN4PPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLCIN4PPS2" edc:mask="0x1" edc:name="CLCIN4PPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLCIN4PPS3" edc:mask="0x1" edc:name="CLCIN4PPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLCIN4PPS4" edc:mask="0x1" edc:name="CLCIN4PPS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLCIN4PPS5" edc:mask="0x1" edc:name="CLCIN4PPS5" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="CLCIN4PPS" edc:mask="0x3f" edc:name="CLCIN4PPS" edc:nzwidth="0x6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
