garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/edc/PIC18F55Q71.PIC
            </edc:SelectSFR>
            <edc:SelectSFR edc:when="($0xC &amp; 0x0C) == 0x08">
              <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CRCXORT" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="CRCXORT" edc:nzwidth="8" edc:por="00000000" edc:_addr="0x355">
                <edc:SFRModeList>
                  <edc:SFRMode edc:id="DS.0">
                    <edc:SFRFieldDef edc:cname="XOR" edc:mask="0xff" edc:name="XOR" edc:nzwidth="0x8"/>
                  </edc:SFRMode>
                  <edc:SFRMode edc:id="LT.0">
                    <edc:SFRFieldDef edc:cname="XOR24" edc:mask="0x1" edc:name="XOR24" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="XOR25" edc:mask="0x1" edc:name="XOR25" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="XOR26" edc:mask="0x1" edc:name="XOR26" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="XOR27" edc:mask="0x1" edc:name="XOR27" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="XOR28" edc:mask="0x1" edc:name="XOR28" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="XOR29" edc:mask="0x1" edc:name="XOR29" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="XOR30" edc:mask="0x1" edc:name="XOR30" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="XOR31" edc:mask="0x1" edc:name="XOR31" edc:nzwidth="0x1"/>
                  </edc:SFRMode>
                </edc:SFRModeList>
              </edc:SFRDef>
            </edc:SelectSFR>
          </edc:MuxedSFRDef>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="nnrnnnnr" edc:cname="CRCCON0" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="CRCCON0" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-04065_math_progcrc_v8.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xb" edc:_addr="0x356">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="FULL" edc:desc="" edc:mask="0x1" edc:name="FULL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SHIFTM" edc:desc="" edc:mask="0x1" edc:name="SHIFTM" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SETUP" edc:mask="0x3" edc:name="SETUP" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="ACCMOD" edc:desc="" edc:mask="0x1" edc:name="ACCMOD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CRCBUSY" edc:desc="" edc:mask="0x1" edc:name="CRCBUSY" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CRCGO" edc:desc="" edc:mask="0x1" edc:name="CRCGO" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CRCEN" edc:desc="" edc:mask="0x1" edc:name="CRCEN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="LENDIAN" edc:mask="0x1" edc:name="LENDIAN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SETUP0" edc:mask="0x1" edc:name="SETUP0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SETUP1" edc:mask="0x1" edc:name="SETUP1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ACCM" edc:mask="0x1" edc:name="ACCM" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BUSY" edc:mask="0x1" edc:name="BUSY" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="GO" edc:mask="0x1" edc:name="GO" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EN" edc:mask="0x1" edc:name="EN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="CRCCON1" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000" edc:name="CRCCON1" edc:nzwidth="8" edc:por="---00000" edc:_modsrc="DOS-04065_math_progcrc_v8.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xb" edc:_addr="0x357">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PLEN" edc:mask="0x1f" edc:name="PLEN" edc:nzwidth="0x5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PLEN0" edc:desc="" edc:mask="0x1" edc:name="PLEN0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PLEN1" edc:desc="" edc:mask="0x1" edc:name="PLEN1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PLEN2" edc:desc="" edc:mask="0x1" edc:name="PLEN2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PLEN3" edc:desc="" edc:mask="0x1" edc:name="PLEN3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PLEN4" edc:mask="0x1" edc:name="PLEN4" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="CRCCON2" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000" edc:name="CRCCON2" edc:nzwidth="8" edc:por="---00000" edc:_modsrc="DOS-04065_math_progcrc_v8.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xb" edc:_addr="0x358">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DLEN" edc:mask="0x1f" edc:name="DLEN" edc:nzwidth="0x5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="DLEN0" edc:mask="0x1" edc:name="DLEN0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DLEN1" edc:mask="0x1" edc:name="DLEN1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DLEN2" edc:mask="0x1" edc:name="DLEN2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DLEN3" edc:mask="0x1" edc:name="DLEN3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DLEN4" edc:mask="0x1" edc:name="DLEN4" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0x1" edc:_addr="0x359"/>
        <edc:JoinedSFRDef edc:cname="SCANLADR" edc:desc="" edc:name="SCANLADR" edc:nzwidth="0x10" edc:_modsrc="DOS-03165_nvm_scan_8bit_v1_generic.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x35A">
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="SCANLADRL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="SCANLADRL" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03165_nvm_scan_8bit_v1_generic.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x35A">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="LADR" edc:mask="0xff" edc:name="LADR" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="LADR0" edc:mask="0x1" edc:name="LADR0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="LADR1" edc:mask="0x1" edc:name="LADR0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="LADR2" edc:mask="0x1" edc:name="LADR0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="LADR3" edc:mask="0x1" edc:name="LADR0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="LADR4" edc:mask="0x1" edc:name="LADR0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="LADR5" edc:mask="0x1" edc:name="LADR0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="LADR6" edc:mask="0x1" edc:name="LADR0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="LADR7" edc:mask="0x1" edc:name="LADR0" edc:nzwidth="0x1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="SCANLADR" edc:mask="0xff" edc:name="SCANLADR" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="SCANLADR0" edc:mask="0x1" edc:name="SCANLADR0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SCANLADR1" edc:mask="0x1" edc:name="SCANLADR0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SCANLADR2" edc:mask="0x1" edc:name="SCANLADR0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SCANLADR3" edc:mask="0x1" edc:name="SCANLADR0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SCANLADR4" edc:mask="0x1" edc:name="SCANLADR0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SCANLADR5" edc:mask="0x1" edc:name="SCANLADR0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SCANLADR6" edc:mask="0x1" edc:name="SCANLADR0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SCANLADR7" edc:mask="0x1" edc:name="SCANLADR0" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="SCANLADRH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="SCANLADRH" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03165_nvm_scan_8bit_v1_generic.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x35B">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="LADR" edc:mask="0xff" edc:name="LADR" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="LADR8" edc:mask="0x1" edc:name="LADR8" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="LADR9" edc:mask="0x1" edc:name="LADR9" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="LADR10" edc:mask="0x1" edc:name="LADR10" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="LADR11" edc:mask="0x1" edc:name="LADR11" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="LADR12" edc:mask="0x1" edc:name="LADR12" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="LADR13" edc:mask="0x1" edc:name="LADR13" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="LADR14" edc:mask="0x1" edc:name="LADR14" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="LADR15" edc:mask="0x1" edc:name="LADR15" edc:nzwidth="0x1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="SCANLADR" edc:mask="0xff" edc:name="SCANLADR" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="SCANLADR8" edc:mask="0x1" edc:name="SCANLADR8" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SCANLADR9" edc:mask="0x1" edc:name="SCANLADR9" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SCANLADR10" edc:mask="0x1" edc:name="SCANLADR10" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SCANLADR11" edc:mask="0x1" edc:name="SCANLADR11" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SCANLADR12" edc:mask="0x1" edc:name="SCANLADR12" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SCANLADR13" edc:mask="0x1" edc:name="SCANLADR13" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SCANLADR14" edc:mask="0x1" edc:name="SCANLADR14" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SCANLADR15" edc:mask="0x1" edc:name="SCANLADR15" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="--nnnnnn" edc:cname="SCANLADRU" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="SCANLADRU" edc:nzwidth="8" edc:por="--000000" edc:_modsrc="DOS-03165_nvm_scan_8bit_v1_generic.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x35C">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="LADR" edc:mask="0x3f" edc:name="LADR" edc:nzwidth="0x6"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="LADR16" edc:mask="0x1" edc:name="LADR16" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="LADR17" edc:mask="0x1" edc:name="LADR17" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="LADR18" edc:mask="0x1" edc:name="LADR18" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="LADR19" edc:mask="0x1" edc:name="LADR19" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="LADR20" edc:mask="0x1" edc:name="LADR20" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="LADR21" edc:mask="0x1" edc:name="LADR21" edc:nzwidth="0x1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="SCANLADR" edc:mask="0x3f" edc:name="SCANLADR" edc:nzwidth="0x6"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="SCANLADR16" edc:mask="0x1" edc:name="SCANLADR16" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SCANLADR17" edc:mask="0x1" edc:name="SCANLADR17" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SCANLADR18" edc:mask="0x1" edc:name="SCANLADR18" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SCANLADR19" edc:mask="0x1" edc:name="SCANLADR19" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SCANLADR20" edc:mask="0x1" edc:name="SCANLADR20" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SCANLADR21" edc:mask="0x1" edc:name="SCANLADR21" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:JoinedSFRDef edc:cname="SCANHADR" edc:desc="" edc:name="SCANHADR" edc:nzwidth="0x10" edc:_modsrc="DOS-03165_nvm_scan_8bit_v1_generic.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x35D">
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="SCANHADRL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111" edc:name="SCANHADRL" edc:nzwidth="8" edc:por="11111111" edc:_modsrc="DOS-03165_nvm_scan_8bit_v1_generic.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x35D">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="HADR" edc:mask="0xff" edc:name="HADR" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="HADR0" edc:mask="0x1" edc:name="HADR0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="HADR1" edc:mask="0x1" edc:name="HADR0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="HADR2" edc:mask="0x1" edc:name="HADR0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="HADR3" edc:mask="0x1" edc:name="HADR0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="HADR4" edc:mask="0x1" edc:name="HADR0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="HADR5" edc:mask="0x1" edc:name="HADR0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="HADR6" edc:mask="0x1" edc:name="HADR0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="HADR7" edc:mask="0x1" edc:name="HADR0" edc:nzwidth="0x1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="SCANHADR" edc:mask="0xff" edc:name="SCANHADR" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="SCANHADR0" edc:mask="0x1" edc:name="SCANHADR0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SCANHADR1" edc:mask="0x1" edc:name="SCANHADR0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SCANHADR2" edc:mask="0x1" edc:name="SCANHADR0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SCANHADR3" edc:mask="0x1" edc:name="SCANHADR0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SCANHADR4" edc:mask="0x1" edc:name="SCANHADR0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SCANHADR5" edc:mask="0x1" edc:name="SCANHADR0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SCANHADR6" edc:mask="0x1" edc:name="SCANHADR0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SCANHADR7" edc:mask="0x1" edc:name="SCANHADR0" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
