garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/edc/PIC18F55Q71.PIC
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="ADACCH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx" edc:name="ADACCH" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-04879_adc_sarcore_mp_ctrl_v5.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x27" edc:_addr="0x3E4">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="ACC" edc:desc="" edc:mask="0xff" edc:name="ACC" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="ADACC8" edc:mask="0x1" edc:name="ADACC8" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ADACC9" edc:mask="0x1" edc:name="ADACC9" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ADACC10" edc:mask="0x1" edc:name="ADACC10" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ADACC11" edc:mask="0x1" edc:name="ADACC11" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ADACC12" edc:mask="0x1" edc:name="ADACC12" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ADACC13" edc:mask="0x1" edc:name="ADACC13" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ADACC14" edc:mask="0x1" edc:name="ADACC14" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ADACC15" edc:mask="0x1" edc:name="ADACC15" edc:nzwidth="0x1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="ADACC" edc:mask="0xff" edc:name="ADACC" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="ACC8" edc:mask="0x1" edc:name="ACC8" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ACC9" edc:mask="0x1" edc:name="ACC9" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ACC10" edc:mask="0x1" edc:name="ACC10" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ACC11" edc:mask="0x1" edc:name="ACC11" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ACC12" edc:mask="0x1" edc:name="ACC12" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ACC13" edc:mask="0x1" edc:name="ACC13" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ACC14" edc:mask="0x1" edc:name="ACC14" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ACC15" edc:mask="0x1" edc:name="ACC15" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="------nn" edc:cname="ADACCU" edc:desc="" edc:impl="0x3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------xx" edc:name="ADACCU" edc:nzwidth="8" edc:por="------xx" edc:_modsrc="DOS-04879_adc_sarcore_mp_ctrl_v5.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x27" edc:_addr="0x3E5">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="ACC" edc:mask="0x3" edc:name="ACC" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="ADACC16" edc:mask="0x1" edc:name="ADACC16" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ADACC17" edc:mask="0x1" edc:name="ADACC17" edc:nzwidth="0x1"/>
                <edc:AdjustPoint edc:offset="1"/>
                <edc:AdjustPoint edc:offset="1"/>
                <edc:AdjustPoint edc:offset="1"/>
                <edc:AdjustPoint edc:offset="1"/>
                <edc:AdjustPoint edc:offset="1"/>
                <edc:AdjustPoint edc:offset="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="ADACC" edc:mask="0x3" edc:name="ADACC" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="ACC16" edc:mask="0x1" edc:name="ACC16" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ACC17" edc:mask="0x1" edc:name="ACC17" edc:nzwidth="0x1"/>
                <edc:AdjustPoint edc:offset="1"/>
                <edc:AdjustPoint edc:offset="1"/>
                <edc:AdjustPoint edc:offset="1"/>
                <edc:AdjustPoint edc:offset="1"/>
                <edc:AdjustPoint edc:offset="1"/>
                <edc:AdjustPoint edc:offset="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="ADCNT" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="ADCNT" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-04879_adc_sarcore_mp_ctrl_v5.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x27" edc:_addr="0x3E6">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CNT" edc:desc="" edc:mask="0xff" edc:name="CNT" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ADCNT0" edc:desc="" edc:mask="0x1" edc:name="ADCNT0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADCNT1" edc:desc="" edc:mask="0x1" edc:name="ADCNT1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADCNT2" edc:desc="" edc:mask="0x1" edc:name="ADCNT2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADCNT3" edc:desc="" edc:mask="0x1" edc:name="ADCNT3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADCNT4" edc:desc="" edc:mask="0x1" edc:name="ADCNT4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADCNT5" edc:desc="" edc:mask="0x1" edc:name="ADCNT5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADCNT6" edc:desc="" edc:mask="0x1" edc:name="ADCNT6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADCNT7" edc:desc="" edc:mask="0x1" edc:name="ADCNT7" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="ADCNT" edc:mask="0xff" edc:name="ADCNT" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="CNT0" edc:mask="0x1" edc:name="CNT0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CNT1" edc:mask="0x1" edc:name="CNT1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CNT2" edc:mask="0x1" edc:name="CNT2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CNT3" edc:mask="0x1" edc:name="CNT3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CNT4" edc:mask="0x1" edc:name="CNT4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CNT5" edc:mask="0x1" edc:name="CNT5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CNT6" edc:mask="0x1" edc:name="CNT6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CNT7" edc:mask="0x1" edc:name="CNT7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="ADRPT" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="ADRPT" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-04879_adc_sarcore_mp_ctrl_v5.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x27" edc:_addr="0x3E7">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RPT" edc:desc="" edc:mask="0xff" edc:name="RPT" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ADRPT0" edc:desc="" edc:mask="0x1" edc:name="ADRPT0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADRPT1" edc:desc="" edc:mask="0x1" edc:name="ADRPT1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADRPT2" edc:desc="" edc:mask="0x1" edc:name="ADRPT2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADRPT3" edc:desc="" edc:mask="0x1" edc:name="ADRPT3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADRPT4" edc:desc="" edc:mask="0x1" edc:name="ADRPT4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADRPT5" edc:desc="" edc:mask="0x1" edc:name="ADRPT5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADRPT6" edc:desc="" edc:mask="0x1" edc:name="ADRPT6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADRPT7" edc:desc="" edc:mask="0x1" edc:name="ADRPT7" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="ADRPT" edc:mask="0xff" edc:name="ADRPT" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="RPT0" edc:mask="0x1" edc:name="RPT0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RPT1" edc:mask="0x1" edc:name="RPT1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RPT2" edc:mask="0x1" edc:name="RPT2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RPT3" edc:mask="0x1" edc:name="RPT3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RPT4" edc:mask="0x1" edc:name="RPT4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RPT5" edc:mask="0x1" edc:name="RPT5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RPT6" edc:mask="0x1" edc:name="RPT6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RPT7" edc:mask="0x1" edc:name="RPT7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
