garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/edc/PIC18F55Q71.PIC
        <edc:SFRDef edc:access="----n---" edc:cname="IOCEN" edc:desc="" edc:impl="0x8" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0---" edc:name="IOCEN" edc:nzwidth="8" edc:por="----0---" edc:_modsrc="DOS-xxxxx_port_control_xxK42_8bit.Module" edc:_refcount="5" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x426">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="IOCEN3" edc:mask="0x1" edc:name="IOCEN0" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----n---" edc:cname="IOCEF" edc:desc="" edc:impl="0x8" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0---" edc:name="IOCEF" edc:nzwidth="8" edc:por="----0---" edc:_modsrc="DOS-xxxxx_port_control_xxK42_8bit.Module" edc:_refcount="5" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x427">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="IOCEF3" edc:mask="0x1" edc:name="IOCEF0" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="ANSELF" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111" edc:name="ANSELF" edc:nzwidth="8" edc:por="11111111" edc:_modsrc="DOS-xxxxx_port_control_xxK42_8bit.Module" edc:_refcount="6" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x428">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ANSELF0" edc:mask="0x1" edc:name="ANSELF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ANSELF1" edc:mask="0x1" edc:name="ANSELF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ANSELF2" edc:mask="0x1" edc:name="ANSELF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ANSELF3" edc:mask="0x1" edc:name="ANSELF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ANSELF4" edc:mask="0x1" edc:name="ANSELF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ANSELF5" edc:mask="0x1" edc:name="ANSELF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ANSELF6" edc:mask="0x1" edc:name="ANSELF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ANSELF7" edc:mask="0x1" edc:name="ANSELF0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="WPUF" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="WPUF" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-xxxxx_port_control_xxK42_8bit.Module" edc:_refcount="6" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x429">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="WPUF0" edc:mask="0x1" edc:name="WPUF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WPUF1" edc:mask="0x1" edc:name="WPUF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WPUF2" edc:mask="0x1" edc:name="WPUF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WPUF3" edc:mask="0x1" edc:name="WPUF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WPUF4" edc:mask="0x1" edc:name="WPUF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WPUF5" edc:mask="0x1" edc:name="WPUF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WPUF6" edc:mask="0x1" edc:name="WPUF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WPUF7" edc:mask="0x1" edc:name="WPUF0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="ODCONF" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="ODCONF" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-xxxxx_port_control_xxK42_8bit.Module" edc:_refcount="6" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x42A">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ODCF0" edc:mask="0x1" edc:name="ODCF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCF1" edc:mask="0x1" edc:name="ODCF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCF2" edc:mask="0x1" edc:name="ODCF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCF3" edc:mask="0x1" edc:name="ODCF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCF4" edc:mask="0x1" edc:name="ODCF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCF5" edc:mask="0x1" edc:name="ODCF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCF6" edc:mask="0x1" edc:name="ODCF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCF7" edc:mask="0x1" edc:name="ODCF0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="SLRCONF" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111" edc:name="SLRCONF" edc:nzwidth="8" edc:por="11111111" edc:_modsrc="DOS-xxxxx_port_control_xxK42_8bit.Module" edc:_refcount="6" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x42B">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SLRF0" edc:mask="0x1" edc:name="SLRF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLRF1" edc:mask="0x1" edc:name="SLRF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLRF2" edc:mask="0x1" edc:name="SLRF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLRF3" edc:mask="0x1" edc:name="SLRF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLRF4" edc:mask="0x1" edc:name="SLRF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLRF5" edc:mask="0x1" edc:name="SLRF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLRF6" edc:mask="0x1" edc:name="SLRF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLRF7" edc:mask="0x1" edc:name="SLRF0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="INLVLF" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111" edc:name="INLVLF" edc:nzwidth="8" edc:por="11111111" edc:_modsrc="DOS-xxxxx_port_control_xxK42_8bit.Module" edc:_refcount="6" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x42C">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="INLVLF0" edc:mask="0x1" edc:name="INLVLF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INLVLF1" edc:mask="0x1" edc:name="INLVLF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INLVLF2" edc:mask="0x1" edc:name="INLVLF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INLVLF3" edc:mask="0x1" edc:name="INLVLF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INLVLF4" edc:mask="0x1" edc:name="INLVLF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INLVLF5" edc:mask="0x1" edc:name="INLVLF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INLVLF6" edc:mask="0x1" edc:name="INLVLF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INLVLF7" edc:mask="0x1" edc:name="INLVLF0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="1" edc:_addr="0x42D"/>
        <edc:AdjustPoint edc:offset="1" edc:_addr="0x42E"/>
        <edc:AdjustPoint edc:offset="1" edc:_addr="0x42F"/>
        <edc:AdjustPoint edc:offset="0xD" edc:_addr="0x430"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="IOCWP" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="IOCWP" edc:nzwidth="8" edc:por="00000000" edc:_addr="0x43D">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IOCWP0" edc:mask="0x1" edc:name="IOCWP0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCWP1" edc:mask="0x1" edc:name="IOCWP1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCWP2" edc:mask="0x1" edc:name="IOCWP2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCWP3" edc:mask="0x1" edc:name="IOCWP3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCWP4" edc:mask="0x1" edc:name="IOCWP4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCWP5" edc:mask="0x1" edc:name="IOCWP5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCWP6" edc:mask="0x1" edc:name="IOCWP6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCWP7" edc:mask="0x1" edc:name="IOCWP7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="IOCWN" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="IOCWN" edc:nzwidth="8" edc:por="00000000" edc:_addr="0x43E">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IOCWN0" edc:mask="0x1" edc:name="IOCWN0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCWN1" edc:mask="0x1" edc:name="IOCWN1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCWN2" edc:mask="0x1" edc:name="IOCWN2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCWN3" edc:mask="0x1" edc:name="IOCWN3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCWN4" edc:mask="0x1" edc:name="IOCWN4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCWN5" edc:mask="0x1" edc:name="IOCWN5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCWN6" edc:mask="0x1" edc:name="IOCWN6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCWN7" edc:mask="0x1" edc:name="IOCWN7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="IOCWF" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="IOCWF" edc:nzwidth="8" edc:por="00000000" edc:_addr="0x43F">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IOCWF0" edc:mask="0x1" edc:name="IOCWF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCWF1" edc:mask="0x1" edc:name="IOCWF1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCWF2" edc:mask="0x1" edc:name="IOCWF2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCWF3" edc:mask="0x1" edc:name="IOCWF3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCWF4" edc:mask="0x1" edc:name="IOCWF4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCWF5" edc:mask="0x1" edc:name="IOCWF5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCWF6" edc:mask="0x1" edc:name="IOCWF6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCWF7" edc:mask="0x1" edc:name="IOCWF7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:JoinedSFRDef edc:cname="NCO1ACC" edc:desc="" edc:name="NCO1ACC" edc:nzwidth="0x18" edc:_modsrc="DOS-02547_tmr_dds_v2_generic.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x440">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="NCO1ACCL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="NCO1ACCL" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02547_tmr_dds_v2_generic.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x440">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="ACC" edc:desc="" edc:mask="0xff" edc:name="ACC" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="NCO1ACC0" edc:desc="" edc:mask="0x1" edc:name="NCO1ACC0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO1ACC1" edc:desc="" edc:mask="0x1" edc:name="NCO1ACC1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO1ACC2" edc:desc="" edc:mask="0x1" edc:name="NCO1ACC2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO1ACC3" edc:desc="" edc:mask="0x1" edc:name="NCO1ACC3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO1ACC4" edc:desc="" edc:mask="0x1" edc:name="NCO1ACC4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO1ACC5" edc:desc="" edc:mask="0x1" edc:name="NCO1ACC5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO1ACC6" edc:desc="" edc:mask="0x1" edc:name="NCO1ACC6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO1ACC7" edc:desc="" edc:mask="0x1" edc:name="NCO1ACC7" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="ACC0" edc:mask="0x1" edc:name="ACC0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ACC1" edc:mask="0x1" edc:name="ACC1" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ACC2" edc:mask="0x1" edc:name="ACC2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ACC3" edc:mask="0x1" edc:name="ACC3" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ACC4" edc:mask="0x1" edc:name="ACC4" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ACC5" edc:mask="0x1" edc:name="ACC5" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ACC6" edc:mask="0x1" edc:name="ACC6" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ACC7" edc:mask="0x1" edc:name="ACC7" edc:nzwidth="0x1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="NCO1ACC" edc:mask="0xff" edc:name="NCO1ACC" edc:nzwidth="0x8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="NCO1ACCH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="NCO1ACCH" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02547_tmr_dds_v2_generic.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x441">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="ACC" edc:desc="" edc:mask="0xff" edc:name="ACC" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="NCO1ACC8" edc:desc="" edc:mask="0x1" edc:name="NCO1ACC8" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO1ACC9" edc:desc="" edc:mask="0x1" edc:name="NCO1ACC9" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO1ACC10" edc:desc="" edc:mask="0x1" edc:name="NCO1ACC10" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO1ACC11" edc:desc="" edc:mask="0x1" edc:name="NCO1ACC11" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO1ACC12" edc:desc="" edc:mask="0x1" edc:name="NCO1ACC12" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO1ACC13" edc:desc="" edc:mask="0x1" edc:name="NCO1ACC13" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO1ACC14" edc:desc="" edc:mask="0x1" edc:name="NCO1ACC14" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO1ACC15" edc:desc="" edc:mask="0x1" edc:name="NCO1ACC15" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="ACC8" edc:mask="0x1" edc:name="ACC8" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ACC9" edc:mask="0x1" edc:name="ACC9" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ACC10" edc:mask="0x1" edc:name="ACC10" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ACC11" edc:mask="0x1" edc:name="ACC11" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ACC12" edc:mask="0x1" edc:name="ACC12" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ACC13" edc:mask="0x1" edc:name="ACC13" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ACC14" edc:mask="0x1" edc:name="ACC14" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ACC15" edc:mask="0x1" edc:name="ACC15" edc:nzwidth="0x1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="NCO1ACC" edc:mask="0xff" edc:name="NCO1ACC" edc:nzwidth="0x8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="----nnnn" edc:cname="NCO1ACCU" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="NCO1ACCU" edc:nzwidth="8" edc:por="----0000" edc:_modsrc="DOS-02547_tmr_dds_v2_generic.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x442">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="ACC" edc:desc="" edc:mask="0xf" edc:name="ACC" edc:nzwidth="4"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="NCO1ACC16" edc:desc="" edc:mask="0x1" edc:name="NCO1ACC16" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO1ACC17" edc:desc="" edc:mask="0x1" edc:name="NCO1ACC17" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO1ACC18" edc:desc="" edc:mask="0x1" edc:name="NCO1ACC18" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO1ACC19" edc:desc="" edc:mask="0x1" edc:name="NCO1ACC19" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="ACC16" edc:mask="0x1" edc:name="ACC16" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ACC17" edc:mask="0x1" edc:name="ACC17" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ACC18" edc:mask="0x1" edc:name="ACC18" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="ACC19" edc:mask="0x1" edc:name="ACC19" edc:nzwidth="0x1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="NCO1ACC" edc:mask="0xf" edc:name="NCO1ACC" edc:nzwidth="4"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:JoinedSFRDef edc:cname="NCO1INC" edc:desc="" edc:name="NCO1INC" edc:nzwidth="0x18" edc:_modsrc="DOS-02547_tmr_dds_v2_generic.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x443">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="NCO1INCL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000001" edc:name="NCO1INCL" edc:nzwidth="8" edc:por="00000001" edc:_modsrc="DOS-02547_tmr_dds_v2_generic.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x443">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="INC" edc:desc="" edc:mask="0xff" edc:name="INC" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="NCO1INC0" edc:desc="" edc:mask="0x1" edc:name="NCO1INC0" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO1INC1" edc:desc="" edc:mask="0x1" edc:name="NCO1INC1" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO1INC2" edc:desc="" edc:mask="0x1" edc:name="NCO1INC2" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO1INC3" edc:desc="" edc:mask="0x1" edc:name="NCO1INC3" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO1INC4" edc:desc="" edc:mask="0x1" edc:name="NCO1INC4" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO1INC5" edc:desc="" edc:mask="0x1" edc:name="NCO1INC5" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO1INC6" edc:desc="" edc:mask="0x1" edc:name="NCO1INC6" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="NCO1INC7" edc:desc="" edc:mask="0x1" edc:name="NCO1INC7" edc:nzwidth="1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="INC0" edc:mask="0x1" edc:name="INC0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="INC1" edc:mask="0x1" edc:name="INC1" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="INC2" edc:mask="0x1" edc:name="INC2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="INC3" edc:mask="0x1" edc:name="INC3" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="INC4" edc:mask="0x1" edc:name="INC4" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="INC5" edc:mask="0x1" edc:name="INC5" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="INC6" edc:mask="0x1" edc:name="INC6" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="INC7" edc:mask="0x1" edc:name="INC7" edc:nzwidth="0x1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="NCO1INC" edc:mask="0xff" edc:name="NCO1INC" edc:nzwidth="0x8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
