garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/edc/PIC18F55Q71.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PIE1" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PIE1" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-xxxx_Interrupts_Q71_8bit.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0xb" edc:_addr="0x4A8">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="INT0IE" edc:mask="0x1" edc:name="INT0IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADCH1IE" edc:mask="0x1" edc:name="ADCH1IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADIE" edc:mask="0x1" edc:name="ADIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ACTIE" edc:mask="0x1" edc:name="ACTIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="C1IE" edc:mask="0x1" edc:name="C1IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADCH2IE" edc:mask="0x1" edc:name="ADCH2IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADCH3IE" edc:mask="0x1" edc:name="ADCH3IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADCH4IE" edc:mask="0x1" edc:name="ADCH4IE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnn-nnn" edc:cname="PIE2" edc:desc="" edc:impl="0x6" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000-000" edc:name="PIE2" edc:nzwidth="8" edc:por="0000-000" edc:_modsrc="DOS-xxxx_Interrupts_Q71_8bit.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0xb" edc:_addr="0x4A9">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ZCDIE" edc:mask="0x1" edc:name="ZCDIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLC5IE" edc:mask="0x1" edc:name="CLC5IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCSRIE" edc:mask="0x1" edc:name="IOCSRIE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA1SCNTIE" edc:mask="0x1" edc:name="DMA1SCNTIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA1DCNTIE" edc:mask="0x1" edc:name="DMA1DCNTIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA1ORIE" edc:mask="0x1" edc:name="DMA1ORIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA1AIE" edc:mask="0x1" edc:name="DMA1AIE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnrrr" edc:cname="PIE3" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PIE3" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-xxxx_Interrupts_Q71_8bit.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0xb" edc:_addr="0x4AA">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SPI1RXIE" edc:mask="0x1" edc:name="SPI1RXIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI1TXIE" edc:mask="0x1" edc:name="SPI1TXIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI1IE" edc:mask="0x1" edc:name="SPI1IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR2IE" edc:mask="0x1" edc:name="TMR2IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR1IE" edc:mask="0x1" edc:name="TMR1IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR1GIE" edc:mask="0x1" edc:name="TMR1GIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CCP1IE" edc:mask="0x1" edc:name="CCP1IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR0IE" edc:mask="0x1" edc:name="TMR0IE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rnnnrrrr" edc:cname="PIE4" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PIE4" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-xxxx_Interrupts_Q71_8bit.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0xb" edc:_addr="0x4AB">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="U1RXIE" edc:mask="0x1" edc:name="U1RXIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U1TXIE" edc:mask="0x1" edc:name="U1TXIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U1EIE" edc:mask="0x1" edc:name="U1EIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U1IE" edc:mask="0x1" edc:name="U1IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR3IE" edc:mask="0x1" edc:name="TMR3IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR3GIE" edc:mask="0x1" edc:name="TMR3GIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWM1PIE" edc:mask="0x1" edc:name="PWM1PIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWM1IE" edc:mask="0x1" edc:name="PWM1IE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rnnn-rn-" edc:cname="PIE5" edc:desc="" edc:impl="0xf6" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000-00-" edc:name="PIE5" edc:nzwidth="8" edc:por="0000-00-" edc:_modsrc="DOS-xxxx_Interrupts_Q71_8bit.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0xb" edc:_addr="0x4AC">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CLC6IE" edc:mask="0x1" edc:name="CLC6IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16AIE" edc:mask="0x1" edc:name="TU16AIE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="C2IE" edc:mask="0x1" edc:name="C2IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLC2IE" edc:mask="0x1" edc:name="CLC2IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWM2PIE" edc:mask="0x1" edc:name="PWM2PIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWM2IE" edc:mask="0x1" edc:name="PWM2IE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PIE6" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PIE6" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-xxxx_Interrupts_Q71_8bit.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0xb" edc:_addr="0x4AD">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="INT1IE" edc:mask="0x1" edc:name="INT1IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLC7IE" edc:mask="0x1" edc:name="CLC7IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG1IE" edc:mask="0x1" edc:name="CWG1IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NCO1IE" edc:mask="0x1" edc:name="NCO1IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA2SCNTIE" edc:mask="0x1" edc:name="DMA2SCNTIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA2DCNTIE" edc:mask="0x1" edc:name="DMA2DCNTIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA2ORIE" edc:mask="0x1" edc:name="DMA2ORIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA2AIE" edc:mask="0x1" edc:name="DMA2AIE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
